tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1705_tdd.h
#define CCPR2L                        522
#define CCPR2H                        523
#define CCP2CON                       524
#define CCP2M                         525
#define CCP2M0                        526
#define CCP2M1                        527
#define CCP2M2                        528
#define CCP2M3                        529
#define DC2B0                         530
#define CCP2Y                         531
#define DC2B                          532
#define DC2B1                         533
#define CCP2X                         534
#define CCPTMRS                       535
#define C1TSEL0                       536
#define C1TSEL                        537
#define C1TSEL1                       538
#define C2TSEL0                       539
#define C2TSEL                        540
#define C2TSEL1                       541
#define P3TSEL                        542
#define P3TSEL0                       543
#define P3TSEL1                       544
#define P4TSEL0                       545
#define P4TSEL                        546
#define P4TSEL1                       547
#define SLRCONA                       548
#define SLRA0                         549
#define SLRA1                         550
#define SLRA2                         551
#define SLRA4                         552
#define SLRA5                         553
#define SLRCONC                       554
#define SLRC0                         555
#define SLRC1                         556
#define SLRC2                         557
#define SLRC3                         558
#define SLRC4                         559
#define SLRC5                         560
#define INLVLA                        561
#define INLVLA0                       562
#define INLVLA1                       563
#define INLVLA2                       564
#define INLVLA3                       565
#define INLVLA4                       566
#define INLVLA5                       567
#define INLVLC                        568
#define INLVLC0                       569
#define INLVLC1                       570
#define INLVLC2                       571
#define INLVLC3                       572
#define INLVLC4                       573
#define INLVLC5                       574
#define IOCAP                         575
#define IOCAP0                        576
#define IOCAP1                        577
#define IOCAP2                        578
#define IOCAP3                        579
#define IOCAP4                        580
#define IOCAP5                        581
#define IOCAN                         582
#define IOCAN0                        583
#define IOCAN1                        584
#define IOCAN2                        585
#define IOCAN3                        586
#define IOCAN4                        587
#define IOCAN5                        588
#define IOCAF                         589
#define IOCAF0                        590
#define IOCAF1                        591
#define IOCAF2                        592
#define IOCAF3                        593
#define IOCAF4                        594
#define IOCAF5                        595
#define IOCCP                         596
#define IOCCP0                        597
#define IOCCP1                        598
#define IOCCP2                        599
#define IOCCP3                        600
#define IOCCP4                        601
#define IOCCP5                        602
#define IOCCN                         603
#define IOCCN0                        604
#define IOCCN1                        605
#define IOCCN2                        606
#define IOCCN3                        607
#define IOCCN4                        608
#define IOCCN5                        609
#define IOCCF                         610
#define IOCCF0                        611
#define IOCCF1                        612
#define IOCCF2                        613
#define IOCCF3                        614
#define IOCCF4                        615
#define IOCCF5                        616
#define TMR4                          617
#define PR4                           618
#define T4CON                         619
#define T4CKPS0                       620
#define T4CKPS                        621
#define T4CKPS1                       622
#define TMR4ON                        623
#define T4OUTPS                       624
#define T4OUTPS0                      625
#define T4OUTPS1                      626
#define T4OUTPS2                      627
#define T4OUTPS3                      628
#define TMR6                          629
#define PR6                           630
#define T6CON                         631
#define T6CKPS0                       632
#define T6CKPS                        633
#define T6CKPS1                       634
#define TMR6ON                        635
#define T6OUTPS0                      636
#define T6OUTPS                       637
#define T6OUTPS1                      638
#define T6OUTPS2                      639
#define T6OUTPS3                      640
#define OPA1CON                       641
#define OPA1PCH                       642
#define OPA1PCH0                      643
#define OPA1PCH1                      644
#define OPA1UG                        645
#define OPA1SP                        646
#define OPA1EN                        647
#define OPA2CON                       648
#define OPA2PCH                       649
#define OPA2PCH0                      650
#define OPA2PCH1                      651
#define OPA2UG                        652
#define OPA2SP                        653
#define OPA2EN                        654
#define PWM3DCL0                      655
#define PWM3DCL                       656
#define PWM3DCL1                      657
#define PWM3DCH0                      658
#define PWM3DCH                       659
#define PWM3DCH1                      660
#define PWM3DCH2                      661
#define PWM3DCH3                      662
#define PWM3DCH4                      663
#define PWM3DCH5                      664
#define PWM3DCH6                      665
#define PWM3DCH7                      666
#define PWM3CON                       667
#define PWM3POL                       668
#define PWM3OUT                       669
#define PWM3EN                        670
#define PWM4DCL                       671
#define PWM4DCL0                      672
#define PWM4DCL1                      673
#define PWM4DCH0                      674
#define PWM4DCH                       675
#define PWM4DCH1                      676
#define PWM4DCH2                      677
#define PWM4DCH3                      678
#define PWM4DCH4                      679
#define PWM4DCH5                      680
#define PWM4DCH6                      681
#define PWM4DCH7                      682
#define PWM4CON                       683
#define PWM4POL                       684
#define PWM4OUT                       685
#define PWM4EN                        686
#define COG1PHR                       687
#define G1PHR                         688
#define G1PHR0                        689
#define G1PHR1                        690
#define G1PHR2                        691
#define G1PHR3                        692
#define G1PHR4                        693
#define G1PHR5                        694
#define COG1PHF                       695
#define G1PHF0                        696
#define G1PHF                         697
#define G1PHF1                        698
#define G1PHF2                        699
#define G1PHF3                        700
#define G1PHF4                        701
#define G1PHF5                        702
#define COG1BLKR                      703
#define G1BLKR                        704
#define G1BLKR0                       705
#define G1BLKR1                       706
#define G1BLKR2                       707
#define G1BLKR3                       708
#define G1BLKR4                       709
#define G1BLKR5                       710
#define COG1BLKF                      711
#define G1BLKF                        712
#define G1BLKF0                       713
#define G1BLKF1                       714
#define G1BLKF2                       715
#define G1BLKF3                       716
#define G1BLKF4                       717
#define G1BLKF5                       718
#define COG1DBR                       719
#define G1DBR0                        720
#define G1DBR                         721
#define G1DBR1                        722
#define G1DBR2                        723
#define G1DBR3                        724
#define G1DBR4                        725
#define G1DBR5                        726
#define COG1DBF                       727
#define G1DBF0                        728
#define G1DBF                         729
#define G1DBF1                        730
#define G1DBF2                        731
#define G1DBF3                        732
#define G1DBF4                        733
#define G1DBF5                        734
#define COG1CON0                      735
#define G1MD0                         736
#define G1MD                          737
#define G1MD1                         738
#define G1MD2                         739
#define G1CS0                         740
#define G1CS                          741
#define G1CS1                         742
#define G1LD                          743
#define G1EN                          744
#define COG1CON1                      745
#define G1POLA                        746
#define G1POLB                        747
#define G1POLC                        748
#define G1POLD                        749
#define G1FDBS                        750
#define G1RDBS                        751
#define COG1RIS                       752
#define G1RIS0                        753
#define G1RIS1                        754
#define G1RIS2                        755
#define G1RIS3                        756
#define G1RIS4                        757
#define G1RIS5                        758
#define G1RIS6                        759
#define COG1RSIM                      760
#define G1RSIM0                       761
#define G1RSIM1                       762
#define G1RSIM2                       763
#define G1RSIM3                       764
#define G1RSIM4                       765
#define G1RSIM5                       766
#define G1RSIM6                       767
#define COG1FIS                       768
#define G1FIS0                        769
#define G1FIS1                        770
#define G1FIS2                        771
#define G1FIS3                        772
#define G1FIS4                        773
#define G1FIS5                        774
#define G1FIS6                        775
#define COG1FSIM                      776
#define G1FSIM0                       777
#define G1FSIM1                       778
#define G1FSIM2                       779
#define G1FSIM3                       780
#define G1FSIM4                       781
#define G1FSIM5                       782
#define G1FSIM6                       783
#define COG1ASD0                      784
#define G1ASDAC0                      785
#define G1ASDAC                       786
#define G1ASDAC1                      787
#define G1ASDBD0                      788
#define G1ASDBD                       789
#define G1ASDBD1                      790
#define G1ARSEN                       791
#define G1ASE                         792
#define COG1ASD1                      793
#define G1AS0E                        794
#define G1AS1E                        795
#define G1AS2E                        796
#define G1AS3E                        797
#define COG1STR                       798
#define G1STRA                        799
#define G1STRB                        800
#define G1STRC                        801
#define G1STRD                        802
#define G1SDATA                       803
#define G1SDATB                       804
#define G1SDATC                       805
#define G1SDATD                       806
#define PPSLOCK                       807
#define PPSLOCKED                     808
#define INTPPS                        809
#define T0CKIPPS                      810
#define T1CKIPPS                      811
#define T1GPPS                        812
#define CCP1PPS                       813
#define CCP2PPS                       814
#define COGINPPS                      815
#define SSPCLKPPS                     816
#define SSPDATPPS                     817
#define SSPSSPPS                      818
#define RXPPS                         819
#define CKPPS                         820
#define CLCIN0PPS                     821
#define CLCIN1PPS                     822
#define CLCIN2PPS                     823
#define CLCIN3PPS                     824
#define RA0PPS                        825
#define RA1PPS                        826
#define RA2PPS                        827
#define RA4PPS                        828
#define RA5PPS                        829
#define RC0PPS                        830
#define RC1PPS                        831
#define RC2PPS                        832
#define RC3PPS                        833
#define RC4PPS                        834
#define RC5PPS                        835
#define CLCDATA                       836
#define MCLC1OUT                      837
#define MCLC2OUT                      838
#define MCLC3OUT                      839
#define CLC1CON                       840
#define CLC1CON_MODE                  841
#define LC1MODE0                      842
#define LC1MODE                       843
#define CLC1CON_MODE0                 844
#define LC1MODE1                      845
#define CLC1CON_MODE1                 846
#define CLC1CON_MODE2                 847
#define LC1MODE2                      848
#define LC1INTN                       849
#define CLC1CON_INTN                  850
#define LC1INTP                       851
#define CLC1CON_INTP                  852
#define CLC1CON_OUT                   853
#define LC1OUT                        854
#define LC1EN                         855
#define CLC1CON_EN                    856
#define CLC1POL                       857
#define LC1G1POL                      858
#define CLC1POL_G1POL                 859
#define CLC1POL_G2POL                 860
#define LC1G2POL                      861
#define LC1G3POL                      862
#define CLC1POL_G3POL                 863
#define LC1G4POL                      864
#define CLC1POL_G4POL                 865
#define CLC1POL_POL                   866
#define LC1POL                        867
#define CLC1SEL0                      868
#define CLC1SEL0_D1S0                 869
#define LC1D1S                        870
#define LC1D1S0                       871
#define CLC1SEL0_D1S                  872
#define CLC1SEL0_D1S1                 873
#define LC1D1S1                       874
#define CLC1SEL0_D1S2                 875
#define LC1D1S2                       876
#define CLC1SEL0_D1S3                 877
#define LC1D1S3                       878
#define CLC1SEL0_D1S4                 879
#define LC1D1S4                       880
#define CLC1SEL1                      881
#define CLC1SEL1_D2S0                 882
#define CLC1SEL1_D2S                  883
#define LC1D2S                        884
#define LC1D2S0                       885
#define CLC1SEL1_D2S1                 886
#define LC1D2S1                       887
#define LC1D2S2                       888
#define CLC1SEL1_D2S2                 889
#define LC1D2S3                       890
#define CLC1SEL1_D2S3                 891
#define LC1D2S4                       892
#define CLC1SEL1_D2S4                 893
#define CLC1SEL2                      894
#define LC1D3S0                       895
#define CLC1SEL2_D3S                  896
#define LC1D3S                        897
#define CLC1SEL2_D3S0                 898
#define LC1D3S1                       899
#define CLC1SEL2_D3S1                 900
#define LC1D3S2                       901
#define CLC1SEL2_D3S2                 902
#define LC1D3S3                       903
#define CLC1SEL2_D3S3                 904
#define LC1D3S4                       905
#define CLC1SEL2_D3S4                 906
#define CLC1SEL3                      907
#define CLC1SEL3_D4S                  908
#define LC1D4S                        909
#define LC1D4S0                       910
#define CLC1SEL3_D4S0                 911
#define CLC1SEL3_D4S1                 912
#define LC1D4S1                       913
#define LC1D4S2                       914
#define CLC1SEL3_D4S2                 915
#define LC1D4S3                       916
#define CLC1SEL3_D4S3                 917
#define LC1D4S4                       918
#define CLC1SEL3_D4S4                 919
#define CLC1GLS0                      920
#define CLC1GLS0_D1N                  921
#define LC1G1D1N                      922
#define CLC1GLS0_D1T                  923
#define LC1G1D1T                      924
#define LC1G1D2N                      925
#define CLC1GLS0_D2N                  926
#define LC1G1D2T                      927
#define CLC1GLS0_D2T                  928
#define CLC1GLS0_D3N                  929
#define LC1G1D3N                      930
#define CLC1GLS0_D3T                  931
#define LC1G1D3T                      932
#define CLC1GLS0_D4N                  933
#define LC1G1D4N                      934
#define CLC1GLS0_D4T                  935
#define LC1G1D4T                      936
#define CLC1GLS1                      937
#define CLC1GLS1_D1N                  938
#define LC1G2D1N                      939
#define LC1G2D1T                      940
#define CLC1GLS1_D1T                  941
#define CLC1GLS1_D2N                  942
#define LC1G2D2N                      943
#define LC1G2D2T                      944
#define CLC1GLS1_D2T                  945
#define CLC1GLS1_D3N                  946
#define LC1G2D3N                      947
#define LC1G2D3T                      948
#define CLC1GLS1_D3T                  949
#define CLC1GLS1_D4N                  950
#define LC1G2D4N                      951
#define LC1G2D4T                      952
#define CLC1GLS1_D4T                  953
#define CLC1GLS2                      954
#define CLC1GLS2_D1N                  955
#define LC1G3D1N                      956
#define LC1G3D1T                      957
#define CLC1GLS2_D1T                  958
#define LC1G3D2N                      959
#define CLC1GLS2_D2N                  960
#define LC1G3D2T                      961
#define CLC1GLS2_D2T                  962
#define CLC1GLS2_D3N                  963
#define LC1G3D3N                      964
#define LC1G3D3T                      965
#define CLC1GLS2_D3T                  966
#define LC1G3D4N                      967
#define CLC1GLS2_D4N                  968
#define LC1G3D4T                      969
#define CLC1GLS2_D4T                  970
#define CLC1GLS3                      971
#define LC1G4D1N                      972
#define CLC1GLS3_G4D1N                973
#define LC1G4D1T                      974
#define CLC1GLS3_G4D1T                975
#define CLC1GLS3_G4D2N                976
#define LC1G4D2N                      977
#define CLC1GLS3_G4D2T                978
#define LC1G4D2T                      979
#define LC1G4D3N                      980
#define CLC1GLS3_G4D3N                981
#define LC1G4D3T                      982
#define CLC1GLS3_G4D3T                983
#define CLC1GLS3_G4D4N                984
#define LC1G4D4N                      985
#define CLC1GLS3_G4D4T                986
#define LC1G4D4T                      987
#define CLC2CON                       988
#define LC2MODE0                      989
#define CLC2CON_MODE                  990
#define LC2MODE                       991
#define CLC2CON_MODE0                 992
#define LC2MODE1                      993
#define CLC2CON_MODE1                 994
#define LC2MODE2                      995
#define CLC2CON_MODE2                 996
#define LC2INTN                       997
#define CLC2CON_INTN                  998
#define LC2INTP                       999
#define CLC2CON_INTP                  1000
#define CLC2CON_OUT                   1001
#define LC2OUT                        1002
#define CLC2CON_EN                    1003
#define LC2EN                         1004
#define CLC2POL                       1005
#define LC2G1POL                      1006
#define CLC2POL_G1POL                 1007
#define LC2G2POL                      1008
#define CLC2POL_G2POL                 1009
#define LC2G3POL                      1010
#define CLC2POL_G3POL                 1011
#define LC2G4POL                      1012
#define CLC2POL_G4POL                 1013
#define CLC2POL_POL                   1014
#define LC2POL                        1015
#define CLC2SEL0                      1016
#define CLC2SEL0_D1S                  1017
#define LC2D1S0                       1018
#define CLC2SEL0_D1S0                 1019
#define LC2D1S                        1020
#define LC2D1S1                       1021
#define CLC2SEL0_D1S1                 1022
#define LC2D1S2                       1023
#define CLC2SEL0_D1S2                 1024
#define CLC2SEL0_D1S3                 1025
#define LC2D1S3                       1026
#define LC2D1S4                       1027
#define CLC2SEL0_D1S4                 1028
#define CLC2SEL1                      1029
#define LC2D2S0                       1030
#define CLC2SEL1_D2S0                 1031
#define LC2D2S                        1032
#define CLC2SEL1_D2S                  1033
#define LC2D2S1                       1034
#define CLC2SEL1_D2S1                 1035
#define LC2D2S2                       1036
#define CLC2SEL1_D2S2                 1037
#define LC2D2S3                       1038
#define CLC2SEL1_D2S3                 1039
#define LC2D2S4                       1040
#define CLC2SEL1_D2S4                 1041
#define CLC2SEL2                      1042
#define CLC2SEL2_D3S                  1043
#define LC2D3S0                       1044
#define CLC2SEL2_D3S0                 1045
#define LC2D3S                        1046
#define CLC2SEL2_D3S1                 1047
#define LC2D3S1                       1048
#define LC2D3S2                       1049
#define CLC2SEL2_D3S2                 1050
#define LC2D3S3                       1051
#define CLC2SEL2_D3S3                 1052
#define LC2D3S4                       1053
#define CLC2SEL2_D3S4                 1054
#define CLC2SEL3                      1055
#define LC2D4S                        1056
#define LC2D4S0                       1057
#define CLC2SEL3_D4S                  1058
#define CLC2SEL3_D4S0                 1059
#define LC2D4S1                       1060
#define CLC2SEL3_D4S1                 1061
#define LC2D4S2                       1062
#define CLC2SEL3_D4S2                 1063
#define CLC2SEL3_D4S3                 1064
#define LC2D4S3                       1065
#define LC2D4S4                       1066
#define CLC2SEL3_D4S4                 1067
#define CLC2GLS0                      1068
#define LC2G1D1N                      1069
#define CLC2GLS0_D1N                  1070
#define CLC2GLS0_D1T                  1071
#define LC2G1D1T                      1072
#define LC2G1D2N                      1073
#define CLC2GLS0_D2N                  1074
#define CLC2GLS0_D2T                  1075
#define LC2G1D2T                      1076
#define LC2G1D3N                      1077
#define CLC2GLS0_D3N                  1078
#define CLC2GLS0_D3T                  1079
#define LC2G1D3T                      1080
#define LC2G1D4N                      1081
#define CLC2GLS0_D4N                  1082
#define CLC2GLS0_D4T                  1083
#define LC2G1D4T                      1084
#define CLC2GLS1                      1085
#define CLC2GLS1_D1N                  1086
#define LC2G2D1N                      1087
#define CLC2GLS1_D1T                  1088
#define LC2G2D1T                      1089
#define CLC2GLS1_D2N                  1090
