tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1705_tdd.h
#define LC2G2D2N                      1091
#define CLC2GLS1_D2T                  1092
#define LC2G2D2T                      1093
#define LC2G2D3N                      1094
#define CLC2GLS1_D3N                  1095
#define LC2G2D3T                      1096
#define CLC2GLS1_D3T                  1097
#define LC2G2D4N                      1098
#define CLC2GLS1_D4N                  1099
#define LC2G2D4T                      1100
#define CLC2GLS1_D4T                  1101
#define CLC2GLS2                      1102
#define LC2G3D1N                      1103
#define CLC2GLS2_D1N                  1104
#define CLC2GLS2_D1T                  1105
#define LC2G3D1T                      1106
#define CLC2GLS2_D2N                  1107
#define LC2G3D2N                      1108
#define LC2G3D2T                      1109
#define CLC2GLS2_D2T                  1110
#define CLC2GLS2_D3N                  1111
#define LC2G3D3N                      1112
#define CLC2GLS2_D3T                  1113
#define LC2G3D3T                      1114
#define CLC2GLS2_D4N                  1115
#define LC2G3D4N                      1116
#define LC2G3D4T                      1117
#define CLC2GLS2_D4T                  1118
#define CLC2GLS3                      1119
#define LC2G4D1N                      1120
#define CLC2GLS3_G4D1N                1121
#define CLC2GLS3_G4D1T                1122
#define LC2G4D1T                      1123
#define CLC2GLS3_G4D2N                1124
#define LC2G4D2N                      1125
#define LC2G4D2T                      1126
#define CLC2GLS3_G4D2T                1127
#define CLC2GLS3_G4D3N                1128
#define LC2G4D3N                      1129
#define CLC2GLS3_G4D3T                1130
#define LC2G4D3T                      1131
#define LC2G4D4N                      1132
#define CLC2GLS3_G4D4N                1133
#define CLC2GLS3_G4D4T                1134
#define LC2G4D4T                      1135
#define CLC3CON                       1136
#define LC3MODE0                      1137
#define CLC3CON_MODE0                 1138
#define CLC3CON_MODE                  1139
#define LC3MODE                       1140
#define LC3MODE1                      1141
#define CLC3CON_MODE1                 1142
#define LC3MODE2                      1143
#define CLC3CON_MODE2                 1144
#define LC3INTN                       1145
#define CLC3CON_INTN                  1146
#define CLC3CON_INTP                  1147
#define LC3INTP                       1148
#define CLC3CON_OUT                   1149
#define LC3OUT                        1150
#define LC3EN                         1151
#define CLC3CON_EN                    1152
#define CLC3POL                       1153
#define LC3G1POL                      1154
#define CLC3POL_G1POL                 1155
#define LC3G2POL                      1156
#define CLC3POL_G2POL                 1157
#define CLC3POL_G3POL                 1158
#define LC3G3POL                      1159
#define LC3G4POL                      1160
#define CLC3POL_G4POL                 1161
#define LC3POL                        1162
#define CLC3POL_POL                   1163
#define CLC3SEL0                      1164
#define CLC3SEL0_D1S0                 1165
#define LC3D1S0                       1166
#define LC3D1S                        1167
#define CLC3SEL0_D1S                  1168
#define LC3D1S1                       1169
#define CLC3SEL0_D1S1                 1170
#define LC3D1S2                       1171
#define CLC3SEL0_D1S2                 1172
#define LC3D1S3                       1173
#define CLC3SEL0_D1S3                 1174
#define LC3D1S4                       1175
#define CLC3SEL0_D1S4                 1176
#define CLC3SEL1                      1177
#define CLC3SEL1_D2S                  1178
#define CLC3SEL1_D2S0                 1179
#define LC3D2S                        1180
#define LC3D2S0                       1181
#define CLC3SEL1_D2S1                 1182
#define LC3D2S1                       1183
#define CLC3SEL1_D2S2                 1184
#define LC3D2S2                       1185
#define CLC3SEL1_D2S3                 1186
#define LC3D2S3                       1187
#define LC3D2S4                       1188
#define CLC3SEL1_D2S4                 1189
#define CLC3SEL2                      1190
#define CLC3SEL2_D3S0                 1191
#define LC3D3S                        1192
#define CLC3SEL2_D3S                  1193
#define LC3D3S0                       1194
#define LC3D3S1                       1195
#define CLC3SEL2_D3S1                 1196
#define LC3D3S2                       1197
#define CLC3SEL2_D3S2                 1198
#define LC3D3S3                       1199
#define CLC3SEL2_D3S3                 1200
#define LC3D3S4                       1201
#define CLC3SEL2_D3S4                 1202
#define CLC3SEL3                      1203
#define CLC3SEL3_D4S0                 1204
#define LC3D4S0                       1205
#define LC3D4S                        1206
#define CLC3SEL3_D4S                  1207
#define LC3D4S1                       1208
#define CLC3SEL3_D4S1                 1209
#define LC3D4S2                       1210
#define CLC3SEL3_D4S2                 1211
#define LC3D4S3                       1212
#define CLC3SEL3_D4S3                 1213
#define LC3D4S4                       1214
#define CLC3SEL3_D4S4                 1215
#define CLC3GLS0                      1216
#define CLC3GLS0_D1N                  1217
#define LC3G1D1N                      1218
#define LC3G1D1T                      1219
#define CLC3GLS0_D1T                  1220
#define LC3G1D2N                      1221
#define CLC3GLS0_D2N                  1222
#define CLC3GLS0_D2T                  1223
#define LC3G1D2T                      1224
#define CLC3GLS0_D3N                  1225
#define LC3G1D3N                      1226
#define LC3G1D3T                      1227
#define CLC3GLS0_D3T                  1228
#define CLC3GLS0_D4N                  1229
#define LC3G1D4N                      1230
#define CLC3GLS0_D4T                  1231
#define LC3G1D4T                      1232
#define CLC3GLS1                      1233
#define LC3G2D1N                      1234
#define CLC3GLS1_D1N                  1235
#define CLC3GLS1_D1T                  1236
#define LC3G2D1T                      1237
#define LC3G2D2N                      1238
#define CLC3GLS1_D2N                  1239
#define LC3G2D2T                      1240
#define CLC3GLS1_D2T                  1241
#define LC3G2D3N                      1242
#define CLC3GLS1_D3N                  1243
#define CLC3GLS1_D3T                  1244
#define LC3G2D3T                      1245
#define LC3G2D4N                      1246
#define CLC3GLS1_D4N                  1247
#define LC3G2D4T                      1248
#define CLC3GLS1_D4T                  1249
#define CLC3GLS2                      1250
#define LC3G3D1N                      1251
#define CLC3GLS2_D1N                  1252
#define LC3G3D1T                      1253
#define CLC3GLS2_D1T                  1254
#define CLC3GLS2_D2N                  1255
#define LC3G3D2N                      1256
#define CLC3GLS2_D2T                  1257
#define LC3G3D2T                      1258
#define CLC3GLS2_D3N                  1259
#define LC3G3D3N                      1260
#define LC3G3D3T                      1261
#define CLC3GLS2_D3T                  1262
#define CLC3GLS2_D4N                  1263
#define LC3G3D4N                      1264
#define CLC3GLS2_D4T                  1265
#define LC3G3D4T                      1266
#define CLC3GLS3                      1267
#define LC3G4D1N                      1268
#define CLC3GLS3_G4D1N                1269
#define LC3G4D1T                      1270
#define CLC3GLS3_G4D1T                1271
#define LC3G4D2N                      1272
#define CLC3GLS3_G4D2N                1273
#define CLC3GLS3_G4D2T                1274
#define LC3G4D2T                      1275
#define LC3G4D3N                      1276
#define CLC3GLS3_G4D3N                1277
#define CLC3GLS3_G4D3T                1278
#define LC3G4D3T                      1279
#define LC3G4D4N                      1280
#define CLC3GLS3_G4D4N                1281
#define LC3G4D4T                      1282
#define CLC3GLS3_G4D4T                1283
#define ICDBK0H                       1284
#define BKA8                          1285
#define BKA9                          1286
#define BKA10                         1287
#define BKA11                         1288
#define BKA12                         1289
#define BKA13                         1290
#define BKA14                         1291
#define STATUS_SHAD                   1292
#define C_SHAD                        1293
#define DC_SHAD                       1294
#define Z_SHAD                        1295
#define WREG_SHAD                     1296
#define BSR_SHAD                      1297
#define PCLATH_SHAD                   1298
#define FSR0L_SHAD                    1299
#define FSR0H_SHAD                    1300
#define FSR1L_SHAD                    1301
#define FSR1H_SHAD                    1302
#define STKPTR                        1303
#define TOSL                          1304
#define TOSH                          1305

#endif // _PIC16F1705_H_
